---
kind: method
id: M:Autodesk.Revit.DB.PlanCircuitSetIterator.#ctor
source: html/a834b7f4-d465-f1ee-db0e-1f709bb79f85.htm
---
# Autodesk.Revit.DB.PlanCircuitSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public PlanCircuitSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.